src/cf/InformationRegisters/СтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовВыплатыСамозанятым</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыПлатежногоПоручения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПоступленияПоСчету</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОтгрузки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусСчетаФактуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСчетаФактуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыплатыСамозанятым</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеДСПлан</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходДСПлан</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыОперацийПлатежноеПоручение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПлатежноеПоручение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарплатаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатыСамозанятым</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаСамозанятому</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СтатусыДокументовВыплатыСамозанятым.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыДокументовВыплатыСамозанятым</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгружено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноОплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекиЗагружены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекиЧастичноЗагружены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ВыплатыСамозанятым.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыплатыСамозанятым</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПрочимиКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетаУчетаЗатратВТаблице</Name>
					<Comment>АПК:58 Документ перенесен из БП</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаВТаблице</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>АПК:58 Документ перенесен из БП</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетОрганизации</Name>
					<Comment>АПК:58 Документ перенесен из БП</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корреспонденция</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Выплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>АПК:58 Документ перенесен из БП</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>АПК:58 Документ перенесен из БП</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаЧек</Name>
							<Comment>Ссылка на чек на сайте ФНС</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЧека</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧекСамозанятого</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВыплатыСамозанятымПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтказа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПричиныОтказаВЧекахВыплатСамозанятым</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасшифровкаРезультата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/ОбменСБанкамиВыплатыСамозанятымПереопределяемый/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен с банками. Выплаты самозанятым".
// Модуль предназначен для размещения переопределяемых процедур подсистемы.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ПолучениеДанныхВыгружаемогоДокумента

// Возвращает данные в виде структуры по связанному документу ПлатежноеПоручение
//
// Параметры:
//		РеестрВыплатыСамозанятым - ДокументСсылка
//		ДанныеПлатежногоПоручения - Структура - структура задается функцией-конструктором ОбменСБанкамиВыплатыСамозанятымСлужебный.ДанныеПлатежногоПоручения()
//
Процедура ДанныеПлатежногоПорученияРеестраВыплатСамозанятым(РеестрВыплатыСамозанятым, ДанныеПлатежногоПоручения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РеестрВыплатСамозанятым", РеестрВыплатыСамозанятым);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПлатежноеПоручение.Ссылка КАК Ссылка,
	|	ПлатежноеПоручение.Номер КАК НомерПлатежногоПоручения,
	|	ПлатежноеПоручение.Дата КАК ДатаПлатежногоПоручения,
	|	ПлатежноеПоручение.БанковскийСчет КАК СчетОрганизации,
	|	ЕСТЬNULL(ПлатежноеПоручение.БанковскийСчет.НомерСчета, "") КАК РасчетныйСчетОрганизации,
	|	ЕСТЬNULL(ПлатежноеПоручение.БанковскийСчет.Банк.Код, "") КАК БИК,
	|	ПлатежноеПоручение.Организация КАК Организация,
	|	ЕСТЬNULL(ПлатежноеПоручение.БанковскийСчет.Банк, ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)) КАК Банк
	|ИЗ
	|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
	|ГДЕ
	|	ПлатежноеПоручение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежноеПоручение.ВыплатыСамозанятым)
	|	И ПлатежноеПоручение.РеестрВыплатСамозанятым = &РеестрВыплатСамозанятым";
	ВыборкаРезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если ВыборкаРезультатЗапроса.Следующий() Тогда		
		ЗаполнитьЗначенияСвойств(ДанныеПлатежногоПоручения, ВыборкаРезультатЗапроса);		
		ДанныеПлатежногоПоручения.НомерПлатежногоПоручения = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(
			ДанныеПлатежногоПоручения.НомерПлатежногоПоручения, 
			Истина, 
			Ложь);
		КонецЕсли;
	
КонецПроцедуры

// Получает данные документов из документа РеестрВыплатыСамозанятым и заполняет данные в структуре ДанныеДокументов 
//
// Параметры:
//		РеестрВыплатыСамозанятым - ДокументСсылка - ссылка на документ,
//										по которому требуется получить данные.
//		ДанныеДокумента - Структура - структура задается функцией-конструктором 
//										ОбменСБанкамиВыплатыСамозанятымСлужебный.ДанныеЗаполненияРеестрВыплатСамозанятым()
//		
Процедура ДанныеРеестраВыплатСамозанятым(РеестрВыплатыСамозанятым, ДанныеДокумента) Экспорт
	
	Запрос = Новый Запрос;	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("РеестрВыплатыСамозанятым", РеестрВыплатыСамозанятым);
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПлатежноеПоручение.РеестрВыплатСамозанятым КАК РеестрВыплатСамозанятым,
	|	ПлатежноеПоручение.Номер КАК НомерПлатежногоПоручения,
	|	ПлатежноеПоручение.Дата КАК ДатаПлатежногоПоручения,
	|	ЕСТЬNULL(ПлатежноеПоручение.БанковскийСчет.НомерСчета, """") КАК РасчетныйСчетОрганизации,
	|	ЕСТЬNULL(ПлатежноеПоручение.БанковскийСчет.Банк.Код, """") КАК БИК
	|ПОМЕСТИТЬ ДанныеПлатежки
	|ИЗ
	|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
	|ГДЕ
	|	ПлатежноеПоручение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежноеПоручение.ВыплатыСамозанятым)
	|	И ПлатежноеПоручение.РеестрВыплатСамозанятым = &РеестрВыплатыСамозанятым
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПлатежногоПоручения УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыплатыСамозанятым.Ссылка КАК Документ,
	|	ВыплатыСамозанятым.Номер КАК НомерРеестра,
	|	ВыплатыСамозанятым.Дата КАК ДатаРеестра,
	|	ВыплатыСамозанятым.Организация КАК Организация,
	|	ЕСТЬNULL(ВыплатыСамозанятым.Организация.НаименованиеПолное, """") КАК НаименованиеОрганизации,
	|	ЕСТЬNULL(ВыплатыСамозанятым.Организация.ИНН, """") КАК ИНН,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДанныеПлатежки.РасчетныйСчетОрганизации, """") <> """"
	|			ТОГДА ЕСТЬNULL(ДанныеПлатежки.РасчетныйСчетОрганизации, """")
	|		ИНАЧЕ ЕСТЬNULL(ВыплатыСамозанятым.СчетОрганизации.НомерСчета, """")
	|	КОНЕЦ КАК РасчетныйСчетОрганизации,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДанныеПлатежки.БИК, """") <> """"
	|			ТОГДА ЕСТЬNULL(ДанныеПлатежки.БИК, """")
	|		ИНАЧЕ ЕСТЬNULL(ВыплатыСамозанятым.СчетОрганизации.Банк.Код, """")
	|	КОНЕЦ КАК БИК,
	|	ВыплатыСамозанятым.Выплаты.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК Нпп,
	|		Контрагент КАК ФизическоеЛицо,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ВыплатыСамозанятым.Выплаты.Контрагент.НаименованиеПолное КАК СТРОКА(1000)), """") <> """"
	|				ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ВыплатыСамозанятым.Выплаты.Контрагент.НаименованиеПолное КАК СТРОКА(1000)), """")
	|			ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(ВыплатыСамозанятым.Выплаты.Контрагент.НаименованиеПолное КАК СТРОКА(1000)), """")
	|		КОНЕЦ КАК ФИО,
	|		ЕСТЬNULL(ВыплатыСамозанятым.Выплаты.Контрагент.ИНН, """") КАК ИНН,
	|		БанковскийСчет КАК БанковскийСчет,
	|		ЕСТЬNULL(ВыплатыСамозанятым.Выплаты.БанковскийСчет.НомерСчета, """") КАК НомерСчета,
	|		ЕСТЬNULL(ВыплатыСамозанятым.Выплаты.БанковскийСчет.Банк.Код, """") КАК БИК,
	|		Сумма КАК Сумма,
	|		Номенклатура КАК Номенклатура,
	|		Содержание КАК Содержание,
	|		ВЫБОР
	|			КОГДА ВыплатыСамозанятым.УслугаВТаблице
	|				ТОГДА ЕСТЬNULL(ВыплатыСамозанятым.Выплаты.Содержание, """")
	|			ИНАЧЕ ЕСТЬNULL(ВыплатыСамозанятым.Номенклатура.НаименованиеПолное, """")
	|		КОНЕЦ КАК НазначениеПлатежа
	|	) КАК Выплаты,
	|	ЕСТЬNULL(ДанныеПлатежки.НомерПлатежногоПоручения, """") КАК НомерПлатежногоПоручения,
	|	ЕСТЬNULL(ДанныеПлатежки.ДатаПлатежногоПоручения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПлатежногоПоручения
	|ИЗ
	|	Документ.ВыплатыСамозанятым КАК ВыплатыСамозанятым
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПлатежки КАК ДанныеПлатежки
	|		ПО ВыплатыСамозанятым.Ссылка = ДанныеПлатежки.РеестрВыплатСамозанятым
	|ГДЕ
	|	ВыплатыСамозанятым.Ссылка = &РеестрВыплатыСамозанятым
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДанныеПлатежки";	
	
	РеквизитыПлатежногоДокумента = Неопределено;	
	РезультатыЗапроса = Запрос.Выполнить();		
	ВыборкаДокумента = РезультатыЗапроса.Выбрать();
	Пока ВыборкаДокумента.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(ДанныеДокумента, ВыборкаДокумента);						
		ДанныеДокумента.ИдПервичногоДокумента = Строка(ДанныеДокумента.Документ.УникальныйИдентификатор());
		НомерРеестра = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокумента.НомерРеестра, Истина, Ложь);
		ДанныеДокумента.НомерРеестра = НомерРеестра;			
		ДанныеДокумента.ДатаФормирования = ТекущаяДатаСеанса();
		ВыборкаСтрокДокумента = ВыборкаДокумента.Выплаты.Выбрать();		
		ОбшаяСумма = 0;
		ОбщееКоличествоСтрок = 0;
		Пока ВыборкаСтрокДокумента.Следующий() Цикл
			
			ДанныеСтрокиДокумента = ДанныеДокумента.ФизЛица.Добавить();			
			ЗаполнитьЗначенияСвойств(ДанныеСтрокиДокумента, ВыборкаСтрокДокумента);
			ОбшаяСумма = ОбшаяСумма + ВыборкаСтрокДокумента.Сумма;
			ОбщееКоличествоСтрок = ОбщееКоличествоСтрок + 1;						
			ФИОФизлица = ФизическиеЛицаКлиентСервер.ЧастиИмени(СокрЛП(ВыборкаСтрокДокумента.ФИО));
			ДанныеСтрокиДокумента.Фамилия = ФИОФизлица.Фамилия;
			ДанныеСтрокиДокумента.Имя = ФИОФизлица.Имя;
			ДанныеСтрокиДокумента.Отчество = ФИОФизлица.Отчество;
			
		КонецЦикла;
		ДанныеДокумента.КоличествоЗаписей = ОбщееКоличествоСтрок;
		ДанныеДокумента.СуммаИтого = ОбшаяСумма;				
				
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаписьДанныхВЗагружаемыйДокумент

// Осуществляет загрузку информации по чекам самозанятых в документ Выплаты самозанятым
//
// Параметры:
//		ДанныеЗаполнения - Структура - данные для заполнения информации по чекам
//			- ОбщиеДанные - Структура - данные для заполнения обшей информации по чекам, 
//								определяется функцией-конструктором ОбменСБанкамиВыплатыСамозанятымСлужебный.ДанныеЗаполнения()
//			- МассивЧеков - Массив - массив из структур ДанныеЗаполненияЧекСамозанятого
//				* ДанныеЗаполненияЧекСамозанятого - Структура - данные для заполнения информации по чекам по каждому самозанятому, 
//						определяется функцией-конструктором ОбменСБанкамиВыплатыСамозанятымСлужебный.ДанныеЗаполнения()
//			- КонтрольныеСуммы - Структура - данные для контроля заполнения
//				* КоличествоЗаписей - Число - количество записей про выплаты самозанятым
//				* СуммаИтого - Число - итоговая сумма, выплаченная самозанятым банком
//		СсылкаНаДокумент - ДокументСсылка - документ, в котором происходит заполнение данных
//
Процедура ПриЗагрузкеРеестраЧековВыплатСамозанятым(ДанныеЗаполнения, СсылкаНаДокумент) Экспорт
	
	Если Не ДанныеЗаполнения.Свойство("ИдПервичногоДокумента") 
		Или Не ЗначениеЗаполнено(ДанныеЗаполнения.ИдПервичногоДокумента) Тогда
		ТекстСообщения = НСтр("ru = 'Не указан ИдПервичногоДокумента в загружаемом файле при загрузке реестра чеков.'");
		Операция = НСтр("ru = 'Загрузка реестра чеков из банка'");
		ПодробныйТекстОшибки = ТекстСообщения;
		ЭлектронноеВзаимодействие.ОбработатьОшибку(Операция, ПодробныйТекстОшибки, ТекстСообщения, "ОбменСБанками");		
		Возврат;
	КонецЕсли;
	Если Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ДанныеЗаполнения.ИдПервичногоДокумента) 
		Или ДанныеЗаполнения.ИдПервичногоДокумента = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор() Тогда
		ТекстСообщения = НСтр("ru = 'Неверный ИдПервичногоДокумента в загружаемом файле (ожидается не пустой GUID) при загрузке реестра чеков.'");
		Операция = НСтр("ru = 'Загрузка реестра чеков из банка'");
		ПодробныйТекстОшибки = ТекстСообщения;
		ЭлектронноеВзаимодействие.ОбработатьОшибку(Операция, ПодробныйТекстОшибки, ТекстСообщения, "ОбменСБанками");
		Возврат;
	КонецЕсли;
	ИдДокумента = Новый УникальныйИдентификатор(ДанныеЗаполнения.ИдПервичногоДокумента);
	СсылкаНаДокумент = Документы.ВыплатыСамозанятым.ПолучитьСсылку(ИдДокумента);
	ДокументОбъект = СсылкаНаДокумент.ПолучитьОбъект();
	Если ДокументОбъект = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Не удалось получить документ Выплаты самозанятым для изменения  при загрузке реестра чеков.'");
		Операция = НСтр("ru = 'Загрузка реестра чеков из банка'");
		ПодробныйТекстОшибки = ТекстСообщения;
		ЭлектронноеВзаимодействие.ОбработатьОшибку(Операция, ПодробныйТекстОшибки, ТекстСообщения, "ОбменСБанками");
		Возврат;
	КонецЕсли;
	Если ДокументОбъект.ПометкаУдаления Тогда
		ДокументОбъект.УстановитьПометкуУдаления(Ложь);
	КонецЕсли;
	
	Параметры = Новый Структура;
	Параметры.Вставить("ИмяМакета", "ЗагрузкаИзФайла");
	Параметры.Вставить("ОбъектДляЗагрузки", СсылкаНаДокумент);
	Параметры.Вставить("Организация", Неопределено);
	Параметры.Вставить("Период", Неопределено);
	Параметры.Вставить("ПострочнаяОбработка", Истина);
	Параметры.Вставить("СопоставлятьКолонки", Истина);
	ТекстОшибки = "";
	ДанныеЗаполненияЧекиСамозанятых = ДанныеЗаполнения.ЧекиСамозанятых.Скопировать();
	КолонкаИНН = ДанныеЗаполненияЧекиСамозанятых.Колонки.Найти("ИНН");
	Если КолонкаИНН <> Неопределено Тогда
		ДанныеЗаполненияЧекиСамозанятых.Колонки.Удалить(КолонкаИНН);
	КонецЕсли;
	Документы.ВыплатыСамозанятым.СопоставитьЗагружаемыеДанныеПострочно(ДанныеЗаполненияЧекиСамозанятых, Параметры, ТекстОшибки);
	ВыплатыСамозанятым.ЗаполнитьЧекиСамозанятыхИзЗагруженныхДанных(ДокументОбъект, ДанныеЗаполненияЧекиСамозанятых);
	
	//Проверим чеки, если по всем чекам в реестре есть отказ, то нужно всему документу присвоить статус Отклонено
	КоличествоОтклонено = 0;
	Для Каждого СтрокаТЧ Из ДокументОбъект.Выплаты Цикл
		Если СтрокаТЧ.ПричинаОтказа <> Перечисления.ПричиныОтказаВЧекахВыплатСамозанятым.ПустаяСсылка() Тогда
			КоличествоОтклонено = КоличествоОтклонено + 1;
		КонецЕсли;
	КонецЦикла;
	Если КоличествоОтклонено = ДокументОбъект.Выплаты.Количество() Тогда
		НовыеСтатусыДокумента = РегистрыСведений.СтатусыДокументов.НовыеСтатусыДокумента();
		НовыеСтатусыДокумента.Статус = Перечисления.СтатусыДокументовВыплатыСамозанятым.Отклонено;
		РегистрыСведений.СтатусыДокументов.УстановитьСтатусыДокумента(СсылкаНаДокумент, НовыеСтатусыДокумента);
	КонецЕсли;
	
	Попытка
		ДокументОбъект.Записать();
	Исключение
		Операция = НСтр("ru = 'Загрузка чеков выплат самозанятым  при загрузке реестра чеков'");
		ПодробныйТекстОшибки = ИнформацияОбОшибке();
		ТекстСообщения = НСтр("ru = 'Ошибка записи документаВыплаты самозанятым  при загрузке реестра чеков'");
		ЭлектронноеВзаимодействие.ОбработатьОшибку(Операция, ПодробныйТекстОшибки, ТекстСообщения, "ОбменСБанками"); 
	КонецПопытки;
	
	Если ДокументОбъект.Выплаты.Количество() <> ДанныеЗаполнения.КоличествоЗаписей Тогда
		ТекстСообщения = НСтр("ru = 'Количество строк в документе не совпадает с контрольными данными  при загрузке реестра чеков.'");
		Операция = НСтр("ru = 'Проверка контрольных сумм при загрузке чеков выплат самозанятым  при загрузке реестра чеков'");
		ПодробныйТекстОшибки = ТекстСообщения;
		ЭлектронноеВзаимодействие.ОбработатьОшибку(Операция, ПодробныйТекстОшибки, ТекстСообщения, "ОбменСБанками");
	КонецЕсли;
	
	Если ДанныеЗаполнения.СуммаИтого <> Неопределено 
		И ДокументОбъект.Выплаты.Итог("Сумма") <> ДанныеЗаполнения.СуммаИтого Тогда
			ТекстСообщения = НСтр("ru = 'Сумма, зачисленная по документу, не совпадает с контрольными данными  при загрузке реестра чеков.'");
			Операция = НСтр("ru = 'Проверка контрольных сумм при загрузке чеков выплат самозанятым  при загрузке реестра чеков'");
			ПодробныйТекстОшибки = ТекстСообщения;
			ЭлектронноеВзаимодействие.ОбработатьОшибку(Операция, ПодробныйТекстОшибки, ТекстСообщения, "ОбменСБанками");
		КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти
